БухЭксп/DataProcessors/CW_ПФ_АктДоходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CW_ПФ_АктДоходы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеПараметры</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СоответствиеАктовИсходящимСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СоответствиеАктовИсходящимСчетам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Акт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчетаЗадолженности</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/DataProcessors/CW_ПФ_АктДоходы/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.2.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВидПечатнаяФорма();
	
	СтруктураОписания.Наименование 				= "Акт";
	СтруктураОписания.Версия					= "3.2.9.2";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.17.2";
	СтруктураОписания.ИсторияИзменений			= Истина;
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "Регистрация");
	
	//Макросы  шаблона представления
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерДокумента]", 			"Номер документа", 				"ПолучитьНомерДокумента(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерИсправления]", 			"Номер исправлния", 			"ПолучитьНомерИсправления(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yyyy]", "Дата документа (dd.MM.yyyy)", 	"ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yy]", 	"Дата документа (dd.MM.yy)",	"ПолучитьДатуДокументаГГ(ПараметрыПроцедуры)");	
	//Макросы  шаблона представления

	Возврат СтруктураОписания;
	
КонецФункции

Процедура Регистрация(Ссылка) Экспорт 

	ИменаМетаданных = Новый Массив;
	ИменаМетаданных.Добавить("Документ.CW_ДоходыПоГрузоперевозке");
	
	ПарамерыРегистрации = CW_ПодключаемыеКомандыСервер.НоваяСтруктураПараметрыРегистрации();
	ПарамерыРегистрации.ПодключаемыйОбъект 	= Ссылка; 
	ПарамерыРегистрации.Представление 		= "Акт"; 
	ПарамерыРегистрации.ИменаМетаданных		= ИменаМетаданных; 		

	CW_ПодключаемыеКомандыСервер.ОбновитьРегистрациюПечатнойФормы(ПарамерыРегистрации);
	
КонецПроцедуры

Функция Использование(ПодключаемыйОбъект=Неопределено) Экспорт 
	
	Возврат (СсылкаНаОбъект.ФормируетсяАкт И НЕ СсылкаНаОбъект.Корректировка И НЕ СсылкаНаОбъект.ЭтоУниверсальныйДокумент) 
			ИЛИ (Не ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль") 
			И СсылкаНаОбъект.ФормируетсяСчет);
	
КонецФункции

Функция ИспользованиеВКонтексте(КонтекстВызова) Экспорт 
	
	Возврат	ТипЗнч(КонтекстВызова) = Тип("ДокументСсылка.CW_ОтчетЭкспедитора")
			И	СсылкаНаОбъект.ФормируетсяАкт 
			И 	НЕ СсылкаНаОбъект.ФормируетсяСчетФактура
			И 	НЕ СсылкаНаОбъект.ЭтоУниверсальныйДокумент;
	
КонецФункции

Функция ПолучитьМакетИсторииИзменений() Экспорт 
	
	Возврат ПолучитьМакет("ИсторияИзменений");
	
КонецФункции

//Функции макросов
Функция ПолучитьНомерДокумента(ПараметрыПроцедуры) Экспорт
	
	Возврат СокрЛП(ПараметрыПроцедуры.НомерДокумента);
	
КонецФункции

Функция ПолучитьНомерИсправления(ПараметрыПроцедуры) Экспорт
	
	НомерИсправления  = ?(ЗначениеЗаполнено(ПараметрыПроцедуры.НомерИсправления), " (испр. "+Формат(ПараметрыПроцедуры.НомерИсправления,"ЧГ=0")+")","");
	Возврат СокрЛП(НомерИсправления);
	
КонецФункции

Функция ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yyyy");
	
КонецФункции

Функция ПолучитьДатуДокументаГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yy");
	
КонецФункции
//Функции макросов

Функция ПечатнаяФорма(НастройкиПечати=Неопределено) Экспорт
	
	Если НастройкиПечати = Неопределено Тогда
		НастройкиПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураНастроекПечати();
	КонецЕсли; 

	РезультатПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураРезультатаПечати();
	
	// формируем представление
	Если ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль") Тогда
		
		СтруктураПараметровБухУчета = Новый Структура;
		СтруктураПараметровБухУчета.Вставить("Договор", 				СсылкаНаОбъект.Договор);
		СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		СсылкаНаОбъект.ПриложениеКДоговору);
		
		ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, СсылкаНаОбъект.Дата);
	
		Если (ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет) Тогда
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(СсылкаНаОбъект.ВедомыйДокумент);
			ДатаДокумента = СсылкаНаОбъект.ВедомыйДокумент.Дата;
		Иначе
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(СсылкаНаОбъект, "НомерАкта", "ДатаАкта");
			ДатаДокумента = СсылкаНаОбъект.ДатаАкта;
		КонецЕсли; 
	Иначе
		НомерДокумента 	= CW_Документы.ПолучитьНомерНаПечать(СсылкаНаОбъект, "НомерСчета", "ДатаСчета");
		ДатаДокумента 	= СсылкаНаОбъект.ДатаСчета;
	КонецЕсли;
	
	ПредставлениеДокумента     = "Акт №"            + НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
	ПредставлениеДокументаАнгл = "Acceptance act №" + НомерДокумента + " of  "+ Формат(ДатаДокумента, "ДФ=dd.MM.yyyy");
	
	//Установка представления печатной формы
	ПараметрыПодключаемогоОбъекта = Новый Структура;
	ПараметрыПодключаемогоОбъекта.Вставить("ПодключаемыйОбъект",	НастройкиПечати.ПодключаемыйОбъект);
	ПараметрыПодключаемогоОбъекта.Вставить("ШаблонПредставления",	НастройкиПечати.ШаблонПредставления);
	ПараметрыПодключаемогоОбъекта.Вставить("Представление",			СокрЛП(ПредставлениеДокумента));
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НомерДокумента",	НомерДокумента);
	ПараметрыПроцедуры.Вставить("ДатаДокумента",	ДатаДокумента);
	ПараметрыПроцедуры.Вставить("НомерИсправления",	СсылкаНаОбъект.НомерИсправления);
	
	РезультатПечати.Представление = CW_ПодключаемыеКомандыСервер.ПолучитьПредставлениеПоШаблону(ЭтотОбъект, ПараметрыПодключаемогоОбъекта, ПараметрыПроцедуры);
	//Установка представления печатной формы
	
	
	// получаем/корректируем параметры печати (кол-во экземпляров, печать по-умолчанию)
	
	КоличествоЭксземпляров = CW_Настройки.ПолучитьНастройкуПользователя(, "КоличествоЭкземпляровИсхАкта", Истина);
	Если КоличествоЭксземпляров <> Неопределено Тогда 
		РезультатПечати.Параметры.Количество = КоличествоЭксземпляров;
		РезультатПечати.Параметры.Печать 	 = (КоличествоЭксземпляров <> 0);  
	Иначе
		РезультатПечати.Параметры.Количество = 2;
		РезультатПечати.Параметры.Печать 	 = Истина;  
	КонецЕсли;  
	
	// формируем печатную форму
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб=Истина;
	
	Макет = ПолучитьМакет("МакетАкт");
	
	ПараметрыВывода = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	ПараметрыВывода.Дата 				= ДатаДокумента;
	ПараметрыВывода.Договор 			= СсылкаНаОбъект.Договор;
	ПараметрыВывода.ПриложениеКДоговору = СсылкаНаОбъект.ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(ПараметрыВывода);
	
	НаименованияОрганизации = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация, ДатаДокумента);
	КППОрганизации 			= Справочники.Организации.КППНаДату(СсылкаНаОбъект.Организация, ДатаДокумента);
	
	НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(СсылкаНаОбъект.Контрагент, ДатаДокумента);

	ИспользуетсяЭлектронныйОбменДанными = Константы.CW_ИспользуетсяЭлектронныйОбменДанными.Получить();
	Если ИспользуетсяЭлектронныйОбменДанными Тогда
		ИдентификаторДокумента = СокрЛП(XMLСтрока(СсылкаНаОбъект));
		Если ПараметрыДоговора.ЯзыкПечатиДокументов=1 Тогда 
			обл_EN = Макет.ПолучитьОбласть("ИдентификаторДокумента_EN");
			обл_EN.Параметры.ИдентификаторДокумента = ИдентификаторДокумента;
			ТабличныйДокумент.Вывести(обл_EN);
		ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов=2 Тогда 
			обл_RU = Макет.ПолучитьОбласть("ИдентификаторДокумента_RU");
			обл_RU.Параметры.ИдентификаторДокумента = ИдентификаторДокумента;
			ТабличныйДокумент.Вывести(обл_RU);
			
			обл_EN = Макет.ПолучитьОбласть("ИдентификаторДокумента_EN");
			обл_EN.Параметры.ИдентификаторДокумента = ИдентификаторДокумента;
			ТабличныйДокумент.Вывести(обл_EN);
		Иначе  
			обл_RU = Макет.ПолучитьОбласть("ИдентификаторДокумента_RU");
			обл_RU.Параметры.ИдентификаторДокумента = ИдентификаторДокумента;
			ТабличныйДокумент.Вывести(обл_RU);
		КонецЕсли; 
	КонецЕсли;
	
	// шапка
	// язык печати документов : 0=русский 1=английский 2=двуязычный
	Если ПараметрыДоговора.ЯзыкПечатиДокументов=1 Тогда 
		обл = Макет.ПолучитьОбласть("Шапка_Иностр");
		стр = CW_Настройки.ПараметрУчетнойПолитики(СсылкаНаОбъект.Дата, СсылкаНаОбъект.Организация, "НаименованиеОрганизацииАнгл")+Символы.ПС+ПараметрыДоговора.АдресОрганизацииАнгл;
		обл.Параметры.ТекстШапки = стр;
		ТабличныйДокумент.Вывести(обл);
	ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов=2 Тогда 
		обл = Макет.ПолучитьОбласть("Шапка_Иностр");
		стр = НаименованияОрганизации.НаименованиеДляПечатныхФорм+Символы.ПС+ПараметрыДоговора.АдресОрганизации+", тел.: "+ПараметрыДоговора.ТелефонОрганизации
		+ Символы.ПС
		+ CW_Настройки.ПараметрУчетнойПолитики(СсылкаНаОбъект.Дата, СсылкаНаОбъект.Организация, "НаименованиеОрганизацииАнгл")+Символы.ПС+ПараметрыДоговора.АдресОрганизацииАнгл
		;
		обл.Параметры.ТекстШапки = стр;
		ТабличныйДокумент.Вывести(обл);
	Иначе 
		Если ПараметрыДоговора.ВыводитьРеквизитыПриПечатиАкта Тогда
			
			КППОрганизации = Справочники.Организации.КППНаДату(СсылкаНаОбъект.Организация, СсылкаНаОбъект.Дата);  
			КППОрганизации = ?(ПустаяСтрока(КППОрганизации), "", ", КПП "+КППОрганизации);
			
			обл = Макет.ПолучитьОбласть("Шапка_Рус");
			Исполнитель = НаименованияОрганизации.НаименованиеДляПечатныхФорм + символы.пс +
				"ИНН "+ СсылкаНаОбъект.Организация.ИНН + КППОрганизации + Символы.ПС +
				"Адрес: " + ПараметрыДоговора.АдресОрганизации + Символы.ПС +
				"Р/С: " + ПараметрыДоговора.РасчетныйСчетОрганизации.НомерСчета + Символы.ПС +
				ПараметрыДоговора.РасчетныйСчетОрганизации.Банк.Наименование + Символы.ПС +
				"К/С: " + ПараметрыДоговора.РасчетныйСчетОрганизации.Банк.КоррСчет + Символы.ПС +
				"БИК: " + ПараметрыДоговора.РасчетныйСчетОрганизации.Банк.Код;
			
			КППКонтрагента = Справочники.Контрагенты.КППНаДату(СсылкаНаОбъект.Контрагент, СсылкаНаОбъект.Дата);
  			КППКонтрагента = ?(ПустаяСтрока(КППКонтрагента), "", ", КПП "+КППКонтрагента);

			Заказчик = НаименованияКонтрагента.ПолноеНаименование + символы.пс +
				"ИНН "+ СсылкаНаОбъект.Контрагент.ИНН + КППКонтрагента + Символы.ПС +
				"Адрес: " + ПараметрыДоговора.Адрес + Символы.ПС +
				"Р/С: " + ПараметрыДоговора.РасчетныйСчет.НомерСчета + Символы.ПС +
				ПараметрыДоговора.РасчетныйСчет.Банк.Наименование + Символы.ПС +
				"К/С: " + ПараметрыДоговора.РасчетныйСчет.Банк.КоррСчет + Символы.ПС +
				"БИК: " + ПараметрыДоговора.РасчетныйСчет.Банк.Код;
			
			обл.Параметры.НадписьИсполнитель = "Исполнитель:";
			обл.Параметры.НадписьЗаказчик    = "Заказчик:";
			обл.Параметры.Исполнитель = Исполнитель;
			обл.Параметры.Заказчик = Заказчик;
			ТабличныйДокумент.Вывести(обл);
			
		КонецЕсли;
	КонецЕсли;
	
	Подписанты = CW_Печать.ВернутьПодписантов(СсылкаНаОбъект, ПараметрыДоговора);
	
	// верхняя часть
	Приложение     = "Договор №";
	ПриложениеАнгл = "Contract №";			
	Если ЗначениеЗаполнено(СсылкаНаОбъект.ПриложениеКДоговору) Тогда
		Приложение     = Строка(СсылкаНаОбъект.ПриложениеКДоговору.ВидДокумента)+" №"+Строка(СсылкаНаОбъект.ПриложениеКДоговору.НомерДокумента)+" от "+Формат(СсылкаНаОбъект.ПриложениеКДоговору.ДатаДокумента,"ДФ=dd.MM.yyyy")+ " к договору №";
		ПриложениеАнгл = "Annex №"+ Строка(СсылкаНаОбъект.ПриложениеКДоговору.НомерДокумента)+" of "+Формат(СсылкаНаОбъект.ПриложениеКДоговору.ДатаДокумента,"ДФ=dd.MM.yyyy")+" to the сontract №";
	КонецЕсли;	
	
	Если ПараметрыДоговора.ЯзыкПечатиДокументов=1 Тогда 
		
		обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_1");
		ТабличныйДокумент.Вывести(обл); 
		
		обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_2");
		обл.Параметры.НомерДатаДокумента = ПредставлениеДокументаАнгл;
		ТабличныйДокумент.Вывести(обл);  
		
		Если ПараметрыДоговора.ВыводитьВАктахИнформациюОСчетах Тогда
			обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_3");
			обл.Параметры.СвязанныеСчета = СписокСвязанныхСчетов(1);
			ТабличныйДокумент.Вывести(обл);
		КонецЕсли;
		
	ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов=2 Тогда
		
		обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_1");
		ТабличныйДокумент.Вывести(обл); 
		
		обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_2");
		обл.Параметры.НомерДатаДокумента = ПредставлениеДокумента; 
		ТабличныйДокумент.Вывести(обл);  
		
		Если ПараметрыДоговора.ВыводитьВАктахИнформациюОСчетах Тогда
			обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_3");
			обл.Параметры.СвязанныеСчета = СписокСвязанныхСчетов(0);
			ТабличныйДокумент.Вывести(обл);
		КонецЕсли;	
	
		обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_2");
		обл.Параметры.НомерДатаДокумента = ПредставлениеДокументаАнгл;
		ТабличныйДокумент.Вывести(обл); 
		
		Если ПараметрыДоговора.ВыводитьВАктахИнформациюОСчетах Тогда
			обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_3");
			обл.Параметры.СвязанныеСчета = СписокСвязанныхСчетов(1);
			ТабличныйДокумент.Вывести(обл);
		КонецЕсли;
		
	Иначе 
		//Если (СсылкаНаОбъект.Валюта=CW_Настройки.ВалютаРегламентированногоУчета()) ИЛИ СсылкаНаОбъект.Договор.ВзаиморасчетыВУЕ Тогда 
		обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Рус");
		обл.Параметры.НадписьАКТ = "АКТ";
		обл.Параметры.НомерРабот = ?(ПараметрыДоговора.Услуги0Или1Работы=0, "оказания услуг", "сдачи-приемки работ")+" № "+НомерДокумента;
		обл.Параметры.НомерДоговора = Приложение + СсылкаНаОбъект.Договор.НомерДоговора + " от " + Формат(СсылкаНаОбъект.Договор.ДатаДоговора,"ДФ=dd.MM.yyyy");
		Если ПараметрыДоговора.ВыводитьВАктахИнформациюОСчетах Тогда
			обл.Параметры.СвязанныеСчета = СписокСвязанныхСчетов(0);
		КонецЕсли;	
		Если ЗначениеЗаполнено(СсылкаНаОбъект.ВедомыйДокумент) Тогда
			обл.Параметры.Дата = Формат(СсылкаНаОбъект.ВедомыйДокумент.Дата, "ДЛФ=DD");
		Иначе
			обл.Параметры.Дата = Формат(СсылкаНаОбъект.ДатаАкта, "ДЛФ=DD");
		КонецЕсли;
		обл.Параметры.Текст = 
		"Мы, нижеподписавшиеся, представитель Исполнителя " + НаименованияОрганизации.НаименованиеДляПечатныхФорм 
		+ " " + Подписанты.РуководительДолжностьРус + " " + Подписанты.РуководительПоДоговору 
		+ " с одной стороны, и представитель Заказчика " 
		+ СокрЛП(НаименованияКонтрагента.ПолноеНаименование + " " + ПараметрыДоговора.ДолжностьРуководителя +" " + ПараметрыДоговора.Руководитель)
		+ ", составили настоящий акт о том, что Исполнитель "
		+?(ПараметрыДоговора.Услуги0Или1Работы=0, "оказал", "выполнил")
		+", а Заказчик принял следующие "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "услуги", "работы")+":"; 
		ТабличныйДокумент.Вывести(обл);
	КонецЕсли;
	
	
	ВывестиНаАнглийском = ПараметрыДоговора.ЯзыкПечатиДокументов=1 или ПараметрыДоговора.ЯзыкПечатиДокументов=2;
	ВывестиНаРрусском 	= ПараметрыДоговора.ЯзыкПечатиДокументов=0 или ПараметрыДоговора.ЯзыкПечатиДокументов=2;
	
	Если ПараметрыДоговора.ЯзыкПечатиДокументов <> 0  Тогда
		обл = Макет.ПолучитьОбласть("ВерхняяЧасть_Иностр_1");
		ТабличныйДокумент.Вывести(обл);
	КонецЕсли;
	
	//Дополнение 
	Если ВывестиНаРрусском и ВывестиНаАнглийском Тогда
		обл = Макет.ПолучитьОбласть("Покупатель_Рус");
		обл.Параметры.Покупатель = СокрЛП(НаименованияКонтрагента.ПолноеНаименование); 
		ТабличныйДокумент.Вывести(обл);
	КонецЕсли; 
	
	Если ПараметрыДоговора.ВыводитьДополнениевШапкуАкта Тогда
		Если ВывестиНаРрусском Тогда
			обл = Макет.ПолучитьОбласть("Дополнительно_Рус");
			обл.Параметры.Дополнительно = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеАкта, СсылкаНаОбъект, Неопределено, СсылкаНаОбъект.Услуги);
			ТабличныйДокумент.Вывести(обл);
		КонецЕсли;
	КонецЕсли;
	
	Если ВывестиНаРрусском и ВывестиНаАнглийском Тогда
		обл = Макет.ПолучитьОбласть("Пробел");
		ТабличныйДокумент.Вывести(обл);
	КонецЕсли;
	
	Если ВывестиНаАнглийском Тогда
		обл = Макет.ПолучитьОбласть("Покупатель_Англ");
		обл.Параметры.Покупатель_Англ = СокрЛП(ПараметрыДоговора.НаименованиеКонтрагентаАнгл); 
		ТабличныйДокумент.Вывести(обл);
		
		Если ПараметрыДоговора.ВыводитьДополнениевШапкуАкта Тогда
			обл = Макет.ПолучитьОбласть("Дополнительно_Англ");
			обл.Параметры.Дополнительно_Англ = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеАктаАнгл, СсылкаНаОбъект, Неопределено, СсылкаНаОбъект.Услуги);
			ТабличныйДокумент.Вывести(обл);
		КонецЕсли;
	КонецЕсли;
	//Дополнение

	
	//--------
	//  шапка таблицы, строки таблицы, подвал таблицы
	облСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	облПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	Если ПараметрыДоговора.ЯзыкПечатиДокументов=1 Тогда 
		облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_Англ");
		облПодвалТаблицы.Параметры.НадписьИТОГО = "TOTAL:";
		стрбезНДС = "Without VAT";
	ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов=2 Тогда 
		облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_Двуяз");
		облПодвалТаблицы.Параметры.НадписьИТОГО = "ИТОГО / TOTAL:";
		стрбезНДС = "БЕЗ НДС / Without VAT";
	Иначе 
		облШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы_Рус");
		облПодвалТаблицы.Параметры.НадписьИТОГО = "ИТОГО:";
		стрбезНДС = "БЕЗ НДС";
	КонецЕсли;
	
	Валюта = ?(СсылкаНаОбъект.Договор.ВзаиморасчетыВУЕ, CW_Настройки.ВалютаРегламентированногоУчета(), СсылкаНаОбъект.Валюта); 
	ПредставлениеВалютыРус = CW_Настройки_ПИ.ПредставлениеВалютыНаРусском(Валюта);
	
	облШапкаТаблицы.Параметры.Заполнить(Новый Структура("Валюта", Валюта));
	облШапкаТаблицы.Параметры.Заполнить(Новый Структура("ВалютаРус", ПредставлениеВалютыРус));
	ТабличныйДокумент.Вывести(облШапкаТаблицы);
	
	ОсновнойЯзык = Константы.CW_ОсновнойЯзык.Получить();
	
	ТаблицаУслуг = CW_Финансы.ПолучитьУслугиДокумента(СсылкаНаОбъект);
	ТаблицаУслуг.Колонки.Добавить("ПредставлениеГП");
	Для Каждого СтрокаУслуг из ТаблицаУслуг Цикл
		СтрокаУслуг.ПредставлениеГП = СокрЛП(СтрокаУслуг.Грузоперевозка.CW_Представление);
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов) И ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.СворачиватьПоГрузоперевозкам Тогда
		ТЗ_Усл = ТаблицаУслуг.Скопировать();
		ТЗ_Ит  = ТаблицаУслуг.Скопировать();
		ТЗ_Ит.Очистить();
		ТЗ_ГП  = ТЗ_Усл.Скопировать();
		ТЗ_ГП.Свернуть("ПредставлениеГП");
		ТЗ_ГП.Колонки.Добавить("Представление");
		ТЗ_ГП.Колонки.Добавить("НомСтр");
		ТЗ_ГП.Колонки.Добавить("Итого");
		НомСтр = 0;
		Для Каждого Стр_ГП из ТЗ_ГП Цикл
			ТЗ_Отбор = ТЗ_Усл.Скопировать(Новый Структура("ПредставлениеГП", Стр_ГП.ПредставлениеГП));
			
			Если ПараметрыДоговора.ЯзыкПечатиДокументов = 1 Тогда 
				Стр_ГП.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ШаблонСверткиПоГрузоперевозкамАнгл, СсылкаНаОбъект, Неопределено, ТЗ_Отбор);
			ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда 
				Стр_ГП.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ШаблонСверткиПоГрузоперевозкам, СсылкаНаОбъект, Неопределено, ТЗ_Отбор) + " / " + CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ШаблонСверткиПоГрузоперевозкамАнгл, СсылкаНаОбъект, Неопределено, ТЗ_Отбор);
			Иначе 
				Стр_ГП.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ШаблонСверткиПоГрузоперевозкам, СсылкаНаОбъект, Неопределено, ТЗ_Отбор);
			КонецЕсли;
			Стр_ГП.НомСтр = НомСтр;
			Стр_ГП.Итого  = ТЗ_Отбор.Итог("Всего");
			
			CW_Печать.ПодготовитьТаблицуУслуг(ТЗ_Отбор, СсылкаНаОбъект, ПараметрыДоговора, "акт");
			Для Каждого Стр_Отбор из ТЗ_Отбор Цикл
				Стр_Ит = ТЗ_Ит.Добавить();
				ЗаполнитьЗначенияСвойств(Стр_Ит, Стр_Отбор);
			КонецЦикла;	
			НомСтр = НомСтр + 1 + ТЗ_Отбор.Количество();
		КонецЦикла;
		ТаблицаУслуг = ТЗ_Ит.Скопировать();
	Иначе	
		CW_Печать.ПодготовитьТаблицуУслуг(ТаблицаУслуг,СсылкаНаОбъект,ПараметрыДоговора,"акт");
	КонецЕсли;	
	
	ВсегоСтрокДляВывода = ТаблицаУслуг.Количество();
	ТекущаяСтрока = 0;
	
	РасчетыУЕ = СсылкаНаОбъект.Договор.ВзаиморасчетыВУЕ;
	
	// подготовим подвал и подписи
	Подвал = Новый ТабличныйДокумент;
	// --- 
	облПодвалТаблицы.Параметры.Сумма = ТаблицаУслуг.Итог(?(РасчетыУЕ, "Сумма_Рег", "Сумма"));
	облПодвалТаблицы.Параметры.СуммаНДС = ТаблицаУслуг.Итог(?(РасчетыУЕ, "НДС_Рег", "НДС"));
	
	ТЗ_НДС = СсылкаНаОбъект.Услуги.Выгрузить();
	ТЗ_НДС.Свернуть("СтавкаНДС");
	
	ОднаСтавкаНДС = ТЗ_НДС.Количество() = 1;
	
	Если облПодвалТаблицы.Параметры.СуммаНДС = 0 Тогда
		Если ОднаСтавкаНДС Тогда
			Если ТЗ_НДС[0].СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
				облПодвалТаблицы.Параметры.СуммаНДС = "-";
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	
	Итого = ТаблицаУслуг.Итог(?(РасчетыУЕ, "Всего_Рег", "Всего"));
	облПодвалТаблицы.Параметры.СуммаИтого = Итого;
	Подвал.Вывести(облПодвалТаблицы);
	// --- 
	// сумма прописью
	обл = Макет.ПолучитьОбласть("НижняяЧасть");
	
	Если ТаблицаУслуг.Итог("НДС") <> 0 Тогда
		
		тСтавкаНДС = " - ";
		Если ОднаСтавкаНДС Тогда
			тСтавкаНДС = Строка(ТЗ_НДС[0].СтавкаНДС) + " - ";
		КонецЕсли;
		
		ПредставлНДС = ", в том числе НДС " + тСтавкаНДС + Формат(ТаблицаУслуг.Итог(?(РасчетыУЕ, "НДС_Рег", "НДС")), "ЧДЦ=2; ЧН=0,00") + " " + ПредставлениеВалютыРус;
		ПредставлНДСАнгл = ", including VAT " +тСтавкаНДС+ Формат(ТаблицаУслуг.Итог(?(РасчетыУЕ, "НДС_Рег", "НДС")), "ЧДЦ=2; ЧРД=.; ЧРГ=,; ЧН=0.00")+" "+ Валюта;
	Иначе
		Если ПараметрыДоговора.ВыводСуммыБезНДСДляАкта = 1 Тогда
			масНДС = СсылкаНаОбъект.Услуги.НайтиСтроки(Новый Структура("СтавкаНДС", Перечисления.СтавкиНДС.НДС0));
			Если масНДС.Количество() > 0 Тогда
				ПредставлНДС = ", без НДС.";
				ПредставлНДСАнгл = ", without VAT."
			Иначе
				ПредставлНДС = ", НДС не облагается.";
				ПредставлНДСАнгл = ", without VAT."
			КонецЕсли;	
		ИначеЕсли ПараметрыДоговора.ВыводСуммыБезНДСДляАкта = 0 Тогда	
			ПредставлНДС = ", в том числе НДС 0,00 " + ПредставлениеВалютыРус; 
			ПредставлНДСАнгл = ", including VAT 0,00 " + Валюта;
		КонецЕсли;				
	КонецЕсли;	
	
	мПеревыставление 			= СсылкаНаОбъект.Услуги.НайтиСтроки(Новый Структура("ПорядокОтражения", ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление")));
	мПеревыставлениеПоСтавкам 	= СсылкаНаОбъект.Услуги.НайтиСтроки(Новый Структура("ПорядокОтражения", ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам")));

	мПеревыставлениеКоличество 				= мПеревыставление.Количество();
	ммПеревыставлениеПоСтавкамКоличество 	= мПеревыставлениеПоСтавкам.Количество();
	
	мВсегоПеревыставление = мПеревыставлениеКоличество + ммПеревыставлениеПоСтавкамКоличество;
	
	тДополнение = "";
	тДополнениеАнгл = "";
	Если мВсегоПеревыставление = СсылкаНаОбъект.Услуги.Количество() Тогда
		//все строки перевыставление
		тДополнение = "возмещаемых ";
		тДополнениеАнгл = "reimbursable ";
	КонецЕсли;
	
	
	Если ПараметрыДоговора.ЯзыкПечатиДокументов=1 Тогда 
		СуммаПрописьюАнгл = CW_Печать.СформироватьСуммуПрописьюАнгл(Итого, Валюта);
		обл.Параметры.ИтоговыйТекст = 
		"Total "+тДополнениеАнгл+?(ПараметрыДоговора.Услуги0Или1Работы=0, "services rendered", "work performed")+" to the amount "+Формат(Итого,"ЧДЦ=2; ЧРД=.; ЧРГ=,")+" "+ ?(СсылкаНаОбъект.Договор.ВзаиморасчетыВУЕ, CW_Настройки.ВалютаРегламентированногоУчета(), Валюта)+" ("+СуммаПрописьюАнгл+")" + ПредставлНДСАнгл  
		+". The above "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "services are rendered", "work is performed")+" in full and on term. The customer has no claims with regarding the range, quality and term of "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "rendered service", "performed work")+"."
		;
		
	ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов=2 Тогда 
		СуммаПрописью = ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(Итого, Валюта); // ВызовБП
		СуммаПрописьюАнгл = CW_Печать.СформироватьСуммуПрописьюАнгл(Итого, Валюта);
		обл.Параметры.ИтоговыйТекст = "Общая стоимость "+тДополнение+?(ПараметрыДоговора.Услуги0Или1Работы=0, "услуг", "работ")+" составляет "+Формат(Итого, "ЧДЦ=2") + " " + ПредставлениеВалютыРус
		+" ("+ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(Итого,?(СсылкаНаОбъект.Договор.ВзаиморасчетыВУЕ, CW_Настройки.ВалютаРегламентированногоУчета(), Валюта))+")" + ПредставлНДС
		+" "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "Услуги оказаны", "Работы выполнены")+" полностью. Стороны претензий по объему, качеству и срокам "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "оказания услуг", "выполнения работ")+" друг к другу не имеют."
		+Символы.ПС
		+Символы.ПС
		+"Total "+тДополнениеАнгл+?(ПараметрыДоговора.Услуги0Или1Работы=0, "services rendered", "work performed")+" to the amount "+Формат(Итого,"ЧДЦ=2; ЧРД=.; ЧРГ=,")+" "+ ?(СсылкаНаОбъект.Договор.ВзаиморасчетыВУЕ, CW_Настройки.ВалютаРегламентированногоУчета(), Валюта)+" ("+СуммаПрописьюАнгл+")" + ПредставлНДСАнгл
		+". The above "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "services are rendered", "work is performed")+" in full and on term. The customer has no claims with regarding the range, quality and term of "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "rendered service", "performed work")+"."
		;
	Иначе 
		// ВызовБП
		обл.Параметры.ИтоговыйТекст = "Общая стоимость "+тДополнение+?(ПараметрыДоговора.Услуги0Или1Работы=0, "услуг", "работ")+" составляет "+Формат(Итого, "ЧДЦ=2") + " " + ПредставлениеВалютыРус  
		+" ("+ОбщегоНазначенияБПВызовСервера.СформироватьСуммуПрописью(Итого,?(РасчетыУЕ, CW_Настройки.ВалютаРегламентированногоУчета(), Валюта))+")" + ПредставлНДС 
		+" "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "Услуги оказаны", "Работы выполнены")+" полностью. Стороны претензий по объему, качеству и срокам "+?(ПараметрыДоговора.Услуги0Или1Работы=0, "оказания услуг", "выполнения работ")+" друг к другу не имеют."
		;
	КонецЕсли;
	Подвал.Вывести(обл);
	
	//----------------------
	// дополнительно
	Если ПараметрыДоговора.ВыводитьДополнениеВПодавлеАкта Тогда
		
		Если ВывестиНаРрусском Тогда
			обл = Макет.ПолучитьОбласть("Дополнительно_Рус");
			обл.Параметры.Дополнительно = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеПодвалаАктаРус, СсылкаНаОбъект, Неопределено, СсылкаНаОбъект.Услуги);
			Подвал.Вывести(обл);
		КонецЕсли;
		Если ВывестиНаАнглийском Тогда
			обл = Макет.ПолучитьОбласть("Дополнительно_Англ");
			обл.Параметры.Дополнительно_Англ = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеПодвалаАктаАнгл, СсылкаНаОбъект, Неопределено, СсылкаНаОбъект.Услуги);
			Подвал.Вывести(обл);
		КонецЕсли;
	КонецЕсли;			
	
	//--------
	// подписи, печать
	Подписанты = CW_Печать.ВернутьПодписантов(СсылкаНаОбъект, ПараметрыДоговора); 
	
	ВыводитьПодписиИПечать 	= НастройкиПечати.ПодписьИПечать или (СсылкаНаОбъект.Договор.ПодписьИПечатьАкты И НастройкиПечати.ДляРассылки) ;
	
	обл = Макет.ПолучитьОбласть("Подписи");  
	
	Если ВыводитьПодписиИПечать Тогда
		ПечатьОрганизации  	= CW_Печать.ПолучитьПечатьОрганизации(СсылкаНаОбъект.Организация, НастройкиПечати.ПодключаемыйОбъект, СсылкаНаОбъект.ДатаАкта, Ложь);
		ПодписьРуководителя = CW_Печать.ПолучитьПодписьСотрудника(Подписанты.Руководитель, Ложь);
	КонецЕсли;
	
	обл.Рисунки.ПечатьОрганизации.Линия 			= Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	обл.Рисунки.ПечатьОрганизации.ВыводитьНаПечать 	= Ложь;
	Если ВыводитьПодписиИПечать и ПечатьОрганизации <> Неопределено Тогда
		обл.Рисунки.ПечатьОрганизации.ВыводитьНаПечать 	= Истина;
		обл.Рисунки.ПечатьОрганизации.Картинка 			= Новый Картинка(ПечатьОрганизации);
	КонецЕсли;
	
	обл.Рисунки.ПодписьРуководителя.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	обл.Рисунки.ПодписьРуководителя.ВыводитьНаПечать 	= Ложь;
	Если ВыводитьПодписиИПечать и ПодписьРуководителя <> Неопределено Тогда
		обл.Рисунки.ПодписьРуководителя.ВыводитьНаПечать 	= Истина;
		обл.Рисунки.ПодписьРуководителя.Картинка 			= Новый Картинка(ПодписьРуководителя);
	КонецЕсли;
	//---подписи, печать
	
	
	Если ПараметрыДоговора.ЯзыкПечатиДокументов=1 Тогда 
		обл.Параметры.НадписьРаботуСдал = "Contractor";
		обл.Параметры.НадписьРаботуПринял = "Customer";
		обл.Параметры.ДолжностьИсполнителя = Подписанты.РуководительДолжностьАнг;
		обл.Параметры.ФИОИсполнителя = CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Подписанты.Руководитель))
		+ ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеАнг), " (" + Подписанты.РуководительОснованиеАнг + ")", "");
		обл.Параметры.ДолжностьЗаказчика = ПараметрыДоговора.ДолжностьРуководителяАнгл;
		обл.Параметры.ФИОЗаказчика = CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.РуководительАнгл) 
		+ ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснованиеАнгл), " (" + ПараметрыДоговора.РуководительКонтрагентаОснованиеАнгл + ")", "");
		обл.Параметры.НадписьМП = "SEAL";
	ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов=2 Тогда 
		обл.Параметры.НадписьРаботуСдал = "Исполнитель / Contractor";
		обл.Параметры.НадписьРаботуПринял = "Заказчик / Customer";
		обл.Параметры.ДолжностьИсполнителя = СокрЛП(Подписанты.РуководительДолжностьРус) + Символы.ПС + СокрЛП(Подписанты.РуководительДолжностьАнг);
		обл.Параметры.ФИОИсполнителя = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.Руководитель,СсылкаНаОбъект.Дата) + ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеРус), " (" + Подписанты.РуководительОснованиеРус + ")", "")
		+Символы.ПС+ CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(РегистрыСведений.CW_ПараметрыСотрудников.ПолучитьФамилиюИмяАнгл(Подписанты.Руководитель)) 
		+?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеАнг), " (" + Подписанты.РуководительОснованиеАнг + ")", "");
		обл.Параметры.ДолжностьЗаказчика = ПараметрыДоговора.ДолжностьРуководителя+Символы.ПС+ПараметрыДоговора.ДолжностьРуководителяАнгл;
		обл.Параметры.ФИОЗаказчика = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.Руководитель,СсылкаНаОбъект.Дата) + ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснование), " (" + ПараметрыДоговора.РуководительКонтрагентаОснование + ")", "") 
		+Символы.ПС+ CW_Печать.ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.РуководительАнгл) + ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснованиеАнгл), " (" + ПараметрыДоговора.РуководительКонтрагентаОснованиеАнгл + ")", "");;  
		обл.Параметры.НадписьМП = "М.П."+Символы.ПС+"SEAL";
	Иначе 
		обл.Параметры.НадписьРаботуСдал = "Исполнитель";
		обл.Параметры.НадписьРаботуПринял = "Заказчик";    
		обл.Параметры.ДолжностьИсполнителя = Подписанты.РуководительДолжностьРус; 
		обл.Параметры.ФИОИсполнителя = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(Подписанты.Руководитель,СсылкаНаОбъект.Дата) + ?(ЗначениеЗаполнено(Подписанты.РуководительОснованиеРус), " (" + Подписанты.РуководительОснованиеРус + ")", "");
		обл.Параметры.ДолжностьЗаказчика = ПараметрыДоговора.ДолжностьРуководителя;
		обл.Параметры.ФИОЗаказчика = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.Руководитель,СсылкаНаОбъект.Дата) + ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснование), " (" + ПараметрыДоговора.РуководительКонтрагентаОснование + ")", ""); 
		обл.Параметры.НадписьМП = "М.П.";
	КонецЕсли;
	Подвал.Вывести(обл);
	
	// подготовка единиц измерения
	ТЗЕИ = ТаблицаУслуг.Скопировать(,"Номенклатура");
	ТЗЕИ.Свернуть("Номенклатура");
	МассивНоменклатуры = ТЗЕИ.ВыгрузитьКолонку("Номенклатура");

	МассивЯзыков = Новый Массив;
	МассивЯзыков.Добавить(Справочники.CW_Языки.ru);
	МассивЯзыков.Добавить(Справочники.CW_Языки.en);

	ОсновнойЯзык = Константы.CW_ОсновнойЯзык.Получить();
	СоответствиеПереводовЕдиниц = Новый Соответствие;

	Для каждого Номенклатура Из МассивНоменклатуры Цикл
		СтруктураПеревода = CW_ПереводыСервер.ПолучитьПереводы(Номенклатура.ЕдиницаИзмерения, , МассивЯзыков);
		СоответствиеПереводовЕдиниц.Вставить(Номенклатура.ЕдиницаИзмерения, СтруктураПеревода);
	КонецЦикла;
	
	НомСтрГП = 0;
	Для каждого усл Из ТаблицаУслуг Цикл
		
		_сф.Инкремент(ТекущаяСтрока);
		
		облСтрокаТаблицы.Параметры.Номер = ТекущаяСтрока;
		облСтрокаТаблицы.Параметры.Наименование = усл.Представление;

		Если СокрЛП(усл.Номенклатура.ЕдиницаИзмерения.Наименование) = "-" Тогда
			облСтрокаТаблицы.Параметры.Единица = "-";
			облСтрокаТаблицы.Параметры.Количество = "-";
			облСтрокаТаблицы.Параметры.Цена = "-";
		Иначе	
			Если (ПараметрыДоговора.ЯзыкПечатиДокументов=0) Тогда
				ЕдиницаИзмерения = СоответствиеПереводовЕдиниц.Получить(усл.Номенклатура.ЕдиницаИзмерения)["ru"];
			ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов=1) Тогда 
				ЕдиницаИзмерения = СоответствиеПереводовЕдиниц.Получить(усл.Номенклатура.ЕдиницаИзмерения)["en"]; 
			ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов=2) Тогда 
				ЕдиницаИзмерения = СоответствиеПереводовЕдиниц.Получить(усл.Номенклатура.ЕдиницаИзмерения)["ru"] + "/" + СоответствиеПереводовЕдиниц.Получить(усл.Номенклатура.ЕдиницаИзмерения)["en"];
			КонецЕсли; 
			облСтрокаТаблицы.Параметры.Единица 		= ЕдиницаИзмерения;
			облСтрокаТаблицы.Параметры.Количество 	= Усл.Количество;
			облСтрокаТаблицы.Параметры.Цена 		= ?(РасчетыУЕ, усл.Цена_Рег, усл.Цена);
		КонецЕсли;	
		
		облСтрокаТаблицы.Параметры.Сумма     = ?(РасчетыУЕ, усл.Сумма_Рег, усл.Сумма);
		
		// подготовим представление ставки "БезНДС"			
		Если (ПараметрыДоговора.ЯзыкПечатиДокументов = 0) Тогда
			ПредставлениеБезНДС = "БЕЗ НДС";
		ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов = 1) Тогда 
			ПредставлениеБезНДС = "Without VAT"; 
		ИначеЕсли (ПараметрыДоговора.ЯзыкПечатиДокументов = 2) Тогда 
			ПредставлениеБезНДС = "БЕЗ НДС / Without VAT";
		КонецЕсли; 
		облСтрокаТаблицы.Параметры.СтавкаНДС = ?(усл.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС, ПредставлениеБезНДС, усл.СтавкаНДС);
		
		облСтрокаТаблицы.Параметры.СуммаНДС  = ?(усл.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС, "-", ?(РасчетыУЕ, усл.НДС_Рег, усл.НДС));
		облСтрокаТаблицы.Параметры.Итого     = ?(РасчетыУЕ, усл.Всего_Рег, усл.Всего);
		
		Если ЗначениеЗаполнено(ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов) И ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.СворачиватьПоГрузоперевозкам Тогда
			СтрТЗ_ГП = ТЗ_ГП.Найти(НомСтрГП, "НомСтр");
			Если СтрТЗ_ГП <> Неопределено Тогда
				ОблГП = Макет.ПолучитьОбласть("Группировка");
				ОблГП.Параметры.Группировка = СтрТЗ_ГП.Представление;
				Если ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов.ВыводитьИтогиПоГрузоперевозкам Тогда
					ОблГП.Параметры.Итого = СтрТЗ_ГП.Итого;
				КонецЕсли;	
				ТабличныйДокумент.Вывести(ОблГП);
				НомСтрГП = НомСтрГП + 1;
			КонецЕсли;	
		КонецЕсли;	
		НомСтрГП = НомСтрГП + 1;
		
		Если ТекущаяСтрока = ВсегоСтрокДляВывода Тогда
			
			// проверяем, влезает ли строка, итог и подвал
			ВТД = Новый ТабличныйДокумент;
			ВТД.Вывести(облСтрокаТаблицы);
			ВТД.Вывести(Подвал);
			
			Если ТабличныйДокумент.ПроверитьВывод(ВТД) Тогда
				
				ТабличныйДокумент.Вывести(ВТД);
				
			Иначе
				
				Если ВсегоСтрокДляВывода =1 Тогда
					
					// ничего не поделать
					ТабличныйДокумент.Вывести(ВТД);
					
				Иначе
					
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(облШапкаТаблицы);
					ТабличныйДокумент.Вывести(ВТД);
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		Иначе
			
			ТабличныйДокумент.Вывести(облСтрокаТаблицы);
			
		КонецЕсли; 
		
		// ---------------------------------------------------------------------------- 
		
	КонецЦикла;
	
	//исполнитель документа
	Если Не СсылкаНаОбъект.Ответственный.Пустая() и ПараметрыДоговора.ВыводитьИсполнителяАкт Тогда
		
		ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель");
		ТабличныйДокумент.Вывести(ОбластьРазделитель);
		
		ТелефонИсполнителя 			= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Ответственный, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПользователя"),,Истина);		
		ИсполнительФизическоеЛицо 	= СсылкаНаОбъект.Ответственный.ФизическоеЛицо;
		
		Если ВывестиНаРрусском Тогда
			Если ИсполнительФизическоеЛицо.Пустая() Тогда
				Исполнитель_рус = "";
			Иначе
				Исполнитель_рус = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ИсполнительФизическоеЛицо);
			КонецЕсли;
			
			ОбластьИсполнитель_Рус = Макет.ПолучитьОбласть("Исполнитель_Рус");
			ОбластьИсполнитель_Рус.Параметры.Исполнитель 		= "Исп.: "+ Исполнитель_рус;
			ОбластьИсполнитель_Рус.Параметры.ТелефонИсполнителя = "Тел.: "+ ТелефонИсполнителя;
			
			ТабличныйДокумент.Вывести(ОбластьИсполнитель_Рус);
		КонецЕсли;
		
		Если ВывестиНаАнглийском Тогда
			Если ИсполнительФизическоеЛицо.Пустая() Тогда
				ИсполнительАнгл = "";
			Иначе
				ИсполнительАнгл =  CW_ПереводыСервер.ПолучитьПеревод(ИсполнительФизическоеЛицо,, Справочники.CW_Языки.en);
				
				ЧастиИмени 			= ФизическиеЛицаКлиентСервер.ЧастиИмени(ИсполнительАнгл);
				Исполнитель_Англ	= ЧастиИмени.Фамилия  + " " + ЧастиИмени.Имя;
			КонецЕсли;
			
			ОбластьИсполнитель_Англ = Макет.ПолучитьОбласть("Исполнитель_Англ");
			ОбластьИсполнитель_Англ.Параметры.Исполнитель_Англ 		  = "Exe.: " + Исполнитель_Англ;
			ОбластьИсполнитель_Англ.Параметры.ТелефонИсполнителя_Англ = "Tel.: " + ТелефонИсполнителя;	
			
			ТабличныйДокумент.Вывести(ОбластьИсполнитель_Англ);
		КонецЕсли;
		
		
	КонецЕсли;
	//исполнитель документа
	
	РезультатПечати.ПечатнаяФорма = ТабличныйДокумент;

	Возврат РезультатПечати;
	
КонецФункции // Печать

Функция СписокСвязанныхСчетов(Язык)
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				СсылкаНаОбъект.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		СсылкаНаОбъект.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, СсылкаНаОбъект.Дата);

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CW_СоответствиеАктовИсходящимСчетам.Счет 
	|ИЗ
	|	РегистрСведений.CW_СоответствиеАктовИсходящимСчетам КАК CW_СоответствиеАктовИсходящимСчетам
	|ГДЕ
	|	CW_СоответствиеАктовИсходящимСчетам.Акт = &Акт";
	Запрос.УстановитьПараметр("Акт", СсылкаНаОбъект);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Ответ = ""; ОтветАнгл = "";
	Для Каждого Стр из ТЗ Цикл
		Если (ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет) Тогда
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Стр.Счет.ВедомыйСчет);
			ДатаДокумента = Стр.Счет.ВедомыйСчет.Дата;
		Иначе
			НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(Стр.Счет, "НомерСчета", "ДатаСчета");
			ДатаДокумента = Стр.Счет.ДатаСчета;
		КонецЕсли; 
		Ответ     = Ответ     + "№" + НомерДокумента + " от " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy") + "; ";
		ОтветАнгл = ОтветАнгл + "№" + НомерДокумента + " of " + Формат(ДатаДокумента, "ДФ=dd.MM.yyyy") + "; ";
	КонецЦикла;	
	
	Если НЕ ЗначениеЗаполнено(Ответ) Тогда
		Возврат "";
	Иначе
		Ответ =     Сред(Ответ,     1, СтрДлина(Ответ)     - 2);
		ОтветАнгл = Сред(ОтветАнгл, 1, СтрДлина(ОтветАнгл) - 2);
		Если Язык = 0 Тогда
			Возврат "к счету " + Ответ;
		ИначеЕсли Язык = 1 Тогда
			Возврат "to invoice " + ОтветАнгл;
		Иначе
			Возврат "к счету " + Ответ + Символы.ПС + "to invoice " + ОтветАнгл;
		КонецЕсли;	
	КонецЕсли;	
	
КонецФункции	
#КонецЕсли
